andrecurvello/RX63N-Collection/RTC/r_rtc_rx/src/r_rtc_rx_hw.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2016 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_rtc_rx_hw.c
* Description  : Main driver code for the Real Time Clock (RTC) peripheral on RX MCUs.
************************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           09.09.2013 1.00    First release.
*           16.04.2014 2.00    Updated for new API.
*           03.09.2014 2.10    Added support for RX64M.
*           03.12.2014 2.20    Added support for RX113.
*           22.01.2015 2.30    Added support for RX71M.
*           20.07.2015 2.40    Added support for RX231.
*           01.03.2016 2.41    Added support for RX130.
*                              Added support for RX230.
*                              Added the rtc_enable_ints function in order to enable the interrupt
*                              regardless of the cold start or warm start. (rtc_init function)
*                              Fixed the issue of initial setting procedure for the time capture.
*                              (rtc_config_capture function)
*           01.10.2016 2.50    Added support for RX65N.
*                              The setting of the carry interrupt enable bit (RCR1.CIE) specified by
*                              the rtc_enable_ints function has been changed from "enabled" to "disabled".
*                              Additionally, the way to set the RCR1 register has been changed from setting
*                              by an immediate value to setting by the RTC_INT_ENABL definition.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "platform.h"
#include "r_rtc_rx_if.h"
#include "r_rtc_rx_config.h"
#include "r_rtc_rx_private.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define RTC_INT_MASK    (0x07)

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
#if !defined(BSP_MCU_RX11_ALL) && !defined(BSP_MCU_RX130)
volatile rtc_cap_ctrl_t  *g_pcap_ctrl = (rtc_cap_ctrl_t *) &RTC.RTCCR0.BYTE;
volatile rtc_cap_time_t  *g_pcap_time = (rtc_cap_time_t *) &RTC.RSECCP0.BYTE;
#endif


/***********************************************************************************************************************
* Function Name: rtc_init
* Description  : This function sets the registers to a known state when cold started. Almost all RTC bits have an
*                unknown value at power up.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_init(void)
{

    /* Set sub-clock drive capacity */
    RTC.RCR3.BYTE = RTC_DRIVE_CAPACITY;
    while(RTC_DRIVE_CAPACITY != RTC.RCR3.BYTE)
    {
        /* Confirm that it has changed, it's slow. */
        nop();
    }

    /* Enable the subclock for RTC */
#if defined(BSP_MCU_RX63_ALL) || defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M)
    RTC.RCR4.BIT.RCKSEL = 0;            // do not use main clock on rx63x/rx71m; not battery-backed
#endif
    RTC.RCR3.BIT.RTCEN = 1;             // enable sub-clock
    while(1 != RTC.RCR3.BIT.RTCEN)
    {
        /* Confirm that it has changed */
        nop();
    }

    /* Wait for six the sub-clock cycles */
    R_BSP_SoftwareDelay((uint32_t)184, (bsp_delay_units_t)BSP_DELAY_MICROSECS);  //Approx.184us (32768Hz * 6cycles = 183.10...us)

    /* Disable RTC interrupts */
    RTC.RCR1.BYTE = 0x00u;
    while (0x00u != RTC.RCR1.BYTE)
    {
        /* Confirm that it has changed */
        nop();
    }

    /* Stop RTC counter */
    rtc_counter_run(RTC_COUNTER_STOP);

