andrecurvello/RX63N-Collection/RTC/r_rtc_rx/src/r_rtc_rx_hw.c
    /* Set RTC to calendar mode */
#if defined(BSP_MCU_RX11_ALL) || defined(BSP_MCU_RX130) || defined(BSP_MCU_RX23_ALL) || defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M)
    RTC.RCR2.BIT.CNTMD = 0;
    while (0 != RTC.RCR2.BIT.CNTMD)
    {
        /* Confirm that it has changed */
        nop();
    }
#endif

    /* Clear alarms, capture regs, adjustment regs, and output enable */
    rtc_reset();

    /* Insure ICU RTC interrupts disabled */
    IEN(RTC,PRD) = 0;
    IEN(RTC,ALM) = 0;
    IEN(RTC,CUP) = 0;

    return;
}
/**********************************************************************************************************************
End of function rtc_init
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_set_periodic
* Description  : This function sets the periodic frequency arguments in the RTC. Arguments are checked
*                prior to calling this function. The ICU interrupts are enabled if RTC_PERIODIC_OFF is
*                not specified.
* Arguments    : freq
*                   - frequency; from enum
*                priority
*                   - interrupt priority; 0 to 15
* Return Value : None
***********************************************************************************************************************/
void rtc_set_periodic(rtc_periodic_t freq, uint8_t priority)
{
    uint8_t tmp;

    /* NOTE: arguments validated before entering this routine */

    /* Set frequency */
    /* Note: Off can be any one of several values. It may not match the "off" value written. */
    tmp = RTC.RCR1.BIT.PES;
    if (RTC.RCR1.BIT.PES != freq)           // if setting needs to change
    {
        RTC.RCR1.BIT.PES = freq;            // write the setting
        while (RTC.RCR1.BIT.PES == tmp)     // loop while setting has not changed
        {
            /* Confirm that it has changed */
            nop();
        }
    }


    /* Set interrupts */
    if (RTC_PERIODIC_OFF == freq)
    {
        IEN(RTC,PRD) = 0;
    }
    else
    {
        IR(RTC,PRD) = 0;
        IPR(RTC,PRD) = priority;
        IEN(RTC,PRD) = 1;
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_set_periodic
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_set_output
* Description  : This function selects the output clock frequency (if not-RX210, RX63x)
*                and turns the output clock output on or off.
* Arguments    : output_freq
*                   - output frequency; from enum
* Return Value : None
***********************************************************************************************************************/
void rtc_set_output(rtc_output_t output_freq)
{
    uint8_t counter_state;


    /* NOTE: valid output_freq verified before entering this routine */

    counter_state = RTC.RCR2.BIT.START;         // save start bit/counter state

    rtc_counter_run(RTC_COUNTER_STOP);          // set start bit to 0/stop counters
    RTC.RCR2.BIT.RTCOE = 0;                     // disable output

    if (RTC_OUTPUT_OFF != output_freq)
    {
#if defined(BSP_MCU_RX11_ALL) || defined(BSP_MCU_RX130) || defined(BSP_MCU_RX23_ALL) || defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M)
        RTC.RCR1.BIT.RTCOS = (uint8_t)((RTC_OUTPUT_64_HZ == output_freq) ? 1 : 0);   // set bit for 64Hz or 1 Hz operation
#endif
        RTC.RCR2.BIT.RTCOE = 1;                 // enable output (always 1Hz for RX210, RX63x MCUs)
    }

    rtc_counter_run(counter_state);             // restore start bit setting/counter state
    return;
}
/**********************************************************************************************************************
End of function rtc_set_output
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_set_current_time
* Description  : This function stops the counters, sets the current time,
*                then returns the counters to its previous state.
* Arguments    : p_current
*                   - structure pointer to current date/time
* Return Value : None
***********************************************************************************************************************/
void rtc_set_current_time (tm_t * p_current)
{
    uint8_t clock_state;

    /* Note the clock state */
    clock_state = RTC.RCR2.BIT.START;

    /* Stop RTC counter */
    rtc_counter_run(RTC_COUNTER_STOP);

    /* Set for 24-hour mode. */
    RTC.RCR2.BIT.HR24 = 1;

    /* Set time */
    /* Set seconds. (0-59) */
    RTC.RSECCNT.BYTE = rtc_dec_to_bcd((uint8_t)p_current->tm_sec);

    /* Set minutes (0-59) */
    RTC.RMINCNT.BYTE = rtc_dec_to_bcd((uint8_t)p_current->tm_min);

    /* Set hours. (0-23) */
    RTC.RHRCNT.BYTE  = rtc_dec_to_bcd((uint8_t)p_current->tm_hour);

    /* Set the date */
    /* Day of the week (0-6, 0=Sunday) */
    RTC.RWKCNT.BYTE = rtc_dec_to_bcd((uint8_t)p_current->tm_wday);

    /* Day of the month (1-31) */
    RTC.RDAYCNT.BYTE = rtc_dec_to_bcd((uint8_t)p_current->tm_mday);

    /* Month. (1-12, 1=January) */
    RTC.RMONCNT.BYTE = rtc_dec_to_bcd((uint8_t)(p_current->tm_mon + 1));

    /* Year. (00-99) */
    RTC.RYRCNT.WORD  = (uint16_t)(rtc_dec_to_bcd((uint8_t)((p_current->tm_year + 1900) % 100)));

    /* Restore the clock */
    rtc_counter_run(clock_state);

    return;
}
/**********************************************************************************************************************
End of function rtc_set_current_time
***********************************************************************************************************************/


