andrecurvello/RX63N-Collection/RTC/r_rtc_rx/src/r_rtc_rx_hw.c
    /* Days since Sunday (0-6) */
    p_alarm->tm_wday   = RTC.RWKAR.BYTE & 0x07u;

    return;
}
/**********************************************************************************************************************
End of function rtc_read_alarm
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_counter_run
* Description  : Starts or stops the RTC counter.
* Arguments    : action
*                   - 0 to stop, 1 to start
* Return Value : None
***********************************************************************************************************************/
void rtc_counter_run(const uint8_t action)
{

    /* START bit is updated in synchronization with the next count source. */
    while(RTC.RCR2.BIT.START != action)
    {
        RTC.RCR2.BIT.START = action;
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_counter_run
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_reset
* Description  : This function sets the RTC Software Reset bit and waits for the reset to complete.
*                The reset affects the output clock enable, alarm and capture registers.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_reset(void)
{

    RTC.RCR2.BIT.RESET = 1;

    while(0 != RTC.RCR2.BIT.RESET)
    {
        /* Wait for reset to happen before continuing.*/
        nop();
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_reset
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_disable_ints
* Description  : This function disables the RTC and ICU interrupts.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_disable_ints(void)
{

    /* Disable ICU interrupts */
    IEN(RTC,PRD) = 0;
    IEN(RTC,ALM) = 0;
    IEN(RTC,CUP) = 0;

    /* Disable RTC interrupts */
    while ((RTC.RCR1.BYTE & RTC_INT_MASK) != 0)
    {
        RTC.RCR1.BYTE &= (~RTC_INT_MASK);
    }

    /* Clear interrupts request flag */
    IR(RTC,PRD) = 0;
    IR(RTC,ALM) = 0;
    IR(RTC,CUP) = 0;

    return;
}
/**********************************************************************************************************************
End of function rtc_disable_ints
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_enable_ints
* Description  : This function enables the RTC interrupts.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_enable_ints(void)
{

    /* Enable RTC interrupts (PIE and AIE), not ICU yet */
    RTC.RCR1.BYTE = RTC_INT_ENABLE;
    while (RTC_INT_ENABLE != RTC.RCR1.BYTE)
    {
        /* Confirm that it has changed */
        nop();
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_enable_ints
***********************************************************************************************************************/

